[{
        "name": "Enwrong",
        "reason": "Becoming the server owner in 2021",
        "bio": "Robert 'Enwrong' Enright is RLI's current server owner. He became an admin on the 13th of July, 2016. He joined RLI after attempting to (along with one of his friends, sasm8) make an RL Ireland website (completely unrelated to the original Facebook page which RLI grew from), specifically for one tournament aimed at Irish Rocket League players. It didn't have much success, but through the process of making it, Enwrong found the Facebook page and joined it. He has since won precisely basically feck all, and has adminned most tournaments for RLI."
    },
    {
        "name": "Dave Forehead",
        "reason": "Was server owner for almost 4 years",
        "bio": "Dave 'Conor Kostick', 'Dave Ravehead', 'Rave Davehead' Forehead is the greatest legend known to RLI. He was originally an admin on the Facebook page in 2017, and in November of that year was made server owner on the Discord. He has helped create the mainstays of the server, the Helper and 6mans bots, and was always around to cast at lans back in the day. He retired on the 28th of June, 2021, and now spends his time as Overlord of Some McDonalds Somewhere Probably, drinking copious amounts of Football Special and reminiscing about the good old days. Or so I've heard."
    },
    {
        "name": "Barzey",
        "reason": "Has been an on and off Operator since 2018",
        "bio": "Barzey joined the staff team in 2018 when RL Ireland started up it's second attempt at being the home of Rocket League in Ireland. His maturity, dedication, diligence and lack of shooting ability are some of the reasons why he is loved by the community."
    },
    {
        "name": "John_aka_Alwayz",
        "reason": "Becoming Assistant Head Admin of the RLCS Fall Split Major LAN in 2021",
        "bio": "John joined the team in 2019 after quickly showing an appetite for grassroots Rocket League in Ireland. His passion for the game has taken him to heights many would not have seen however it was clear to us that the sky was the limit for him. He's the in house expert on RLCS."
    },
    {
        "name": "LovelyCans",
        "reason": "Becoming an Admin in 2021",
        "bio": "Joining the staff team in 2019, his understanding of what the community wants have propelled him right up to the top spot in place of the late great Dave Forehead. Cans has a nack for being able to play both sides of a debate while still managing to give out about everything. His love for the community is unmatched and his fresh approach is what endears him to many."
    },
    {
        "name": "Res",
        "reason": "Becoming an Operator in 2020",
        "bio": "Sir Reginald Spreadsheets IV joined the staff team in 2020 and went straight past Moderator to the Operator position due to his natural talent of handling spreadsheets. Reginald is one of our beloved members who is not a resident on the island of Ireland, but his quick brain and right wing beliefs are what makes him the insightful and analytical man he is."
    },
    {
        "name": "Lynsk",
        "reason": "Becoming an Operator in 2020",
        "bio": "Joining the team in 2020, the GP of Cans quickly showed bright promise with a thirst for hard work and some difficult tasks from early on. His ability not to shy away from the most boring of jobs made him a prime candidate for the Ops team. His big smile and ability to laugh at just about anything is one of the many reasons why EJam has a poster of him by his bedside locker."
    },
    {
        "name": "Jacko",
        "reason": "Becoming an Operator at LAN #10, 2021",
        "bio": "One of the newest members to join in 2021, Jack in true Kerry man fashion has the ability to read between the lines on many a topic of discussion in RL Ireland. He displays the same traits as all Ops currently have, a real hunger and desire to see the community grow coupled with a yearning for as much knowledge as possible, potentially being the legal council of RL Ireland in the future as well."
    }
]