[{

        "text": "The oracle LovelyCans wil speak again. PSG will not win the champions league when messi is there!",
        "author": "LovelyCans (oracle apparently)",
        "date": "10/08/2021 "

    },

    {

        "text": "there are usually multiple men and it can last for a longer time",
        "author": "Yung Aidan Stubbs",
        "date": "09/08/2k21"

    },

    {

        "text": "dave forehead wasn't so great? Are you kidding me? When was the last time you saw a player with such an ability and movement? dave forehead puts the game in another level, we will be blessed if we ever see a player with his skill and passion for the game again. monkeymoon breaks records, firstkiller breaks records. dave forehead breaks the rules. You can keep your statistics. I prefer the magic.",
        "author": "Luachra",
        "date": "06/08/2021"

    },

    {

        "text": "Shannon is in Sligo isn't it",
        "author": "Pandaa",
        "date": "24/07/2021"

    },

    {

        "text": "180 m for Saka in 4 years.",
        "author": "Reginald Spreadsheets",
        "date": "24/07/2021"

    },

    {

        "text": "If any of the people in this server die of vaccine complications I'll get happens tattooed on my ass",
        "author": "GraHa",
        "date": "16/07/2021"

    },

    {

        "text": "I have as much confidence in England beating Italy as I do Greggs getting a Michelin star before a classic Neapolitan pizza place in Naples",
        "author": "Dopamine on England winning the Euros",
        "date": "07/07/2021"

    },

    {

        "text": "Funny how BDS stands for Bottle Da Series xD",
        "author": "Lovely 'Dmckenna' Cans",
        "date": "03/07/2021"

    },

    {

        "text": "JaRyan is built like an argos catalogue",
        "author": "Coombs",
        "date": "25/03/2021"

    },

    {

        "text": "Use a telescope to look at the flu",
        "author": "Pokewithastick",
        "date": "07/03/2021"

    },

    {

        "text": "decomp if theres one thing i learned in this game, you cant be toxic, and doubht yourself, if you wanna make it, you have to have the drive, passion, motivation, desire, strength, mobility, you cant keep doubhting yourself, and being toxic in a certain way, you gotta say, if i want top 8, top 4, top 2, or to win, im gonna practice practice practice, and achieve what i want, weather my team will help me or not, its about time some of you in here stop being fucking cocks and fix up, maybe you are good at the game, you cantget to the next level, screw the fucking head on, get a drink, put the work in get it done, enough of this boys im fucking sick of it, after being out for a while ive learned that, you gotta come in with a positive attitude or you are fucked.",
        "author": "Ghost",
        "date": "08/02/2021"

    },

    {

        "text": "Saka will be a nobody in 5 years mark my words",
        "author": "LovelyCans",
        "date": "08/02/2021"

    },

    {

        "text": "'1st mistake: Building a bot for a bunch of ungrateful bastards'",
        "author": "Art3mis describing the first 3 hour lecture in Dave Forehead's 'How not to build a bot' lecture",
        "date": "07/04/2021"

    },

    {

        "text": "ELBUFF - Me describing Graha in spanish",
        "author": "Aidan",
        "date": "05/09/2021"

    },

    {

        "text": "Bit of soap and hot water to clean your hands = +300 MMR",
        "author": "Ryan",
        "date": "06/10/2021"

    },

    {

        "text": "girls feet are nice",
        "author": "My_Parable",
        "date": "31/12/2020"

    },

    {

        "text": "&lt;q",
        "author": "carrickdan",
        "date": "28/06/2020"

    },

    {

        "text": "man i think a lot of people here are overthinking things, fair to give suggestions and good to have a community of people trying to ake the server better. but realistically for lower players like myself championship gives you much better games than ranked, definitely helps you improve. don't take it too seriously though try enjoy it more. sure tis all a bit of craic",
        "author": "Flud",
        "date": "01/04/2021"

    },

    {

        "text": "U don't want it enough. U have to want it",
        "author": "Tasterainbows",
        "date": "unknown"

    },

    {

        "text": "1v1 me",
        "author": "Tasterainbows, but also like all of rli at some point or another",
        "date": "he's said it 40 times to date like idk pick any date and he's thought it"

    },

    {

        "text": "You'd play a game of football and have a pure sweaty gooch",
        "author": "decomp",
        "date": "13/11/2020"

    },

    {

        "text": "Anyone know if chilli fucks up your fillings?",
        "author": "Tasterainbows",
        "date": "19/11/2020"

    },

    {

        "text": "Mad how I just took a shit and went from hungover and irrelevant to on top form and READY",
        "author": "decomp",
        "date": "30/05/2021"

    },

    {

        "text": "id rather be dyslexic than an UWUER",
        "author": "Paradox",
        "date": "16/07/2020"

    },

    {

        "text": "My racism is now cured",
        "author": "Jao",
        "date": "unknown"

    },

    {

        "text": "You have more hours than goals in the game",
        "author": "Enwrong",
        "date": "28/03/2020"

    },

    {

        "text": "Sure robk will need the money for his hospital bill bc I will beat him so badly",
        "author": "Tasterainbows",
        "date": "12/06/2020"

    },

    {

        "text": "This shit new phone keeps making errors on spelling kissing me off",
        "author": "Enwrong",
        "date": "18/11/2020"

    },

    {

        "text": "'David Forehead, your body has never appealed to a woman as much as it appeals to me. The thought of being with you and feeling every inch of you does things to me that no man has accomplished before; thus, I stand before you as yours to claim. If you choose to accept I promise that I will devote myself to you and be yours forever. I am to be ravished, and you are to do the ravishing. Click the link to registered: ' Hope this helps",
        "author": "Aidan, on how much he loves Dave Forehead probably",
        "date": "29/10/2021"

    },


    {

        "text": "SPAM PopCorn THIS PopCorn SNACC PopCorn TO PopCorn TAKE PopCorn THE PopCorn SIX PopCorn COUNTIES PopCorn BACC PopCorn ",
        "author": "unknown",
        "date": ""

    },

    {

        "text": "The phrase 'it 'll run fine anyway' is such a weak mindset. You are ok with what happened, losing, imperfection of a craft. When you stop getting angry after dropping below 200 fps, you’ve lost twice. There’s always something to learn, and always room for improvement, never settle.",
        "author": "NuaLaoch",
        "date": "17/02/2021"

    }
]