{
    "header-home": {
        "en": "Home",
        "ga": "Baile"
    },
    "header-timeline": {
        "en": "Timeline",
        "ga": "Amlíne"
    },
    "header-quotes": {
        "en": "Quotes",
        "ga": "Ráitis"
    },
    "header-tournaments": {
        "en": "Tournaments",
        "ga": "Comórtais"
    },
    "header-tournaments-wrs-major": {
        "en": "WRS Major",
        "ga": "WRS Mórchomórtas"
    },
    "header-tournaments-wrs-monthly1": {
        "en": "WRS Monthly #1",
        "ga": "WRS Comórtas Míosúil #1"
    },
    "header-personalities": {
        "en": "Personalities",
        "ga": "Pearsantachtaí"
    },
    "index-title": {
        "en": "Home",
        "ga": "Baile"
    },
    "index-content": {
        "en": "This is a wiki for RL Ireland, a community of Irish people who play Rocket League. Below you can check out our socials, and be sure to read 'The Timeline of RL Ireland', along with the best community quotes, personalities and tournaments we've held!",
        "ga": "Seo wiki fa choinne RLI, grúpa Éireannaigh an imríonn Rocket League. Is féidir muid a fheiceáil ar na meáin sóisialta ar na nascanna faoi, agus deán cinnte 'Stair RL Ireland' a léamh, chomh maith le na ráitis is fearr, beathaisnéis pearsantachtaí agus na comórtais a raibh ar siúl againn!"
    },
    "index-socials": {
        "en": "Link to Linktree for social media accounts:",
        "ga": "Nasc Linktree fa choinne cuntais meáin sóisialta:"
    },
    "index-linktree": {
        "en": "Link",
        "ga": "Nasc"
    },
    "timeline-title": {
        "en": "The Timeline of RL Ireland",
        "ga": "Amlíne de RL Ireland"
    },
    "timeline-origins-title": {
        "en": "Origins",
        "ga": "Bunús"
    },
    "timeline-origins": {
        "en": "RLI was created in somewhat controversial circumstances, naturally. This is the story <strong>as far as we know</strong>.<br><br> Two lads from Donegal called Joseph and Darcy (you may have heard of them) were in 3rd year of secondary school and didn’t know many people around them who played Rocket League. So Darcy had the idea to create RL Ireland, a place where all Irish Rocket League players can come together and play together, a place where they could find teammates and hold tournaments. He told Joseph about this, and when Joseph got home, he made the Facebook page.<br><br> And that is how RLI began.",
        "ga": "Bhí beirt leaid as Tír Chonaill darb ainm Joseph agus Darcy (b’fhéidir gur chuala tú fúthu) sa 3ú bliain den mheánscoil agus ní raibh aithne acu ar mórán daoine timpeall orthu a d’imir Rocket League. Mar sin bhí an smaoineamh ag Darcy RL Ireland a chruthú, áit inar féidir le himreoirí Rocket League as Éireann teacht agus imirt le chéile, áit ina bhféadfaidís teacht ar cairde agus foirne a chrúthú agus comórtais a reáchtáil. D’inis sé do Joseph faoi seo, agus nuair a shroich Joseph an baile, chruthaigh sé an leathanach Facebook.<br><br>Agus sin mar a thosaigh RLI."
    },
    "timeline-2015": {
        "en": "The RL Ireland Facebook page was created on the 28th of December, and new members started trickling in.",
        "ga": "Cruthaíodh leathanach Facebook RL Ireland ar an 28 Nollaig."
    },
    "timeline-2016": {
        "en": "2016 was a fairly quiet year overall, and it's difficult to find out things about this time, but here's a bit of what we know:<br><br> Enwrong (along with one of his friends, sasm8) made an RL Ireland website, completely unrelated to the Facebook page, specifically for one tournament aimed at Irish Rocket League players. It didn't have much success, but through the process of making it, Enwrong found the Facebook page and joined it.<br><br> Enwrong, Darcy and XtremeNolaner all organised tournaments in a fairly random manner, which kept a steady stream of new people joining and kept the page active. Enwrong attempted a league system which unfortunately didn't catch on after the first season, however he did win the top division with Daithí, which is only the second RLI tournament he has ever won (lmao washed). Many a spontaneous 1v1 tournament was also organised. Around July 2016, XtremeNolaner made the Discord server for RLI.",
        "ga": "Bliain réasúnta ciúin a bhí in 2016 ar an iomlán, agus tá sé deacair rudaí a fháil amach faoin am seo, ach seo beagán den t-eolas atá againn:<br><br> Rinne Enwrong (in éineacht le duine dá chairde, sasm8) suíomh gréasáin RL Ireland, nach raibh baint ar bith aige leis an leathanach Facebook, fa choinne comórtais dírithe ar imreoirí Rocket League in Éireann. Níor éirigh go maith leis, ach tríd an bpróiseas lena dhéanamh, fuair Enwrong an leathanach Facebook agus lean sé é.<br><br>D'eagraigh Enwrong, Darcy agus XtremeNolaner comórtais ar bhealach measartha randamach, rud a choinnigh sruth seasta daoine nua ag teacht isteach agus a choinnigh an leathanach gníomhach. Rinne Enwrong iarracht ar chóras sraithe a eagrú, ach faraor níor éirigh leis, ach bhuaigh sé an roinn is fearr le Daithí, agus is é sin an dara Comórtas RLI a bhuaigh sé riamh (nite gmtd). Eagraíodh go leor comórtais 1v1 tobann freisin. Timpeall Iúil 2016, rinne XtremeNolaner an Discord server do RLI."
    },
    "timeline-2017": {
        "en": "The first RLI LAN took place in The Convention Center in Dublin, called GamerCon, on the 18th and 19th of March. Dave Forehead, Daithi and Tully won, with Luke, Dormer and 1Junior1 (LivingLazerHD at the time) coming second. Lynxi, Airside, LTXSam and Warfare also played, Enwrong adminned the event, and Pandaa didn't play but showed up anyway.<br><br> After an argument between Darcy and Enwrong, Enwrong left the server in June. XtremeNolaner also left around this time after he sold his computer. This left Darcy on his own to run tournaments, and since he couldn't run tournaments as often as before by himself, RLI became a lot quieter than before. This is considered by some to be the beginning of the \"dark ages\" of RLI, however in reality tournaments were still being organised and the Discord server received an overhaul, with new text channels and roles being introduced.<br><br> Walshy should also get a small mention here for willingly donating in-game items for the prize pools of the occasional tournament that was organised.<br><br> The Games eXpo Ireland LAN took place in the RDS in Dublin on the 26th of November, with Daithi and XDarkArcticX winning, LTXSam and Warfare coming second and Dave Forehead and Enwrong commentating. Dave Forehead later posted to Facebook about the GXI LAN that kickstarted the revival of RLI. <br><br><img src=\"/assets/Dave-Forehead-FB-post.png\" alt=\"A picture of Dave Forehead's post on Facebook.\"><br><br> On the 28th of November, Dave Forehead was promoted to admin of the Facebook page by Darcy and XtremeNolaner gave him ownership of the discord server. Enwrong was also made admin on both platforms. The first staff meeting happened a day later between the four admins and the newest staff members, who were offered a place based on how long they'd been in the community and how active they'd been. They were Tully, Walshy and Daithi. The RLI twitter account was made on the 30th of November.<br><br> The first tournament RLI ever streamed was a 2v2 christmas event on the 3rd of December, won by Dry and Fusure. (Back then we had tiered tournaments.) <br><br><img src=\"/assets/RLI-christmas-2v2-tournament-results.jpg\" alt=\"A spreadsheet of the tournament results.\"><br><br> The Dry vs McCluvin 1v1 showmatch helped bring RLI to the attention of people outside of Ireland for probably the first time, with help from DigitalBacon. Dry was constantly in the top 10 on the 1s leaderboard in the world at the time, and appeared on JohnnyBoi's stream.",
        "ga": "Tharla an chéad RLI LAN san Ionad Comhdhála i mBaile Átha Cliath, darb ainm GamerCon, ar an 18 agus 19 Márta. Bhuaigh Dave Forehead, Daithi agus Tully, le Luke, Dormer agus 1Junior1 (LivingLazerHD ag an am) ag teacht sa dara háit. D'imir Lynxi, Airside, LTXSam agus Warfare freisin, bhí Enwrong i gceannas ar an ócáid, agus níor imir Pandaa ach thaspain sé suas ar aon nós.<br><br>Tar éis argóint idir Darcy agus Enwrong, d’fhág Enwrong an server i mí an Mheithimh. D’fhág XtremeNolaner timpeall an ama seo freisin tar éis dó a ríomhaire a dhíol. D’fhág seo Darcy leis féin chun camchuairteanna a reáchtáil, agus ós rud é nach raibh sé in ann comórtais a reáchtáil chomh minic agus roimhe seo, d’éirigh RLI i bhfad níos ciúine. Measann cuid daoine gurb é seo tús “aoiseanna dorcha” RLI, ach i ndáiríre bhí comórtais fós á n-eagrú agus rinneadh ollchóiriú ar an server Discord, agus tugadh isteach channels agus róil nua.<br><br>Ba chóir go dtabharfadh tagairt bheag do Walshy anseo freisin as earraí as Rocket League a bhronnadh go toilteanach mar duaiseanna an chomórtais a eagraíodh go h-ócáideach.<br><br>Tharla LAN Games eXpo Ireland san RDS i mBaile Átha Cliath ar an 26 Samhain, le Daithi agus XDarkArcticX ag buachan, LTXSam agus Warfare ag teacht sa dara háit agus Dave Forehead agus Enwrong ag tráchtaireacht. Chuir Dave Forehead post suas ar Facebook ina dhiaidh sin faoin GXI LAN a chuir tús le hathbheochan RLI. <br><br><img src=\"/assets/Dave-Forehead-FB-post.png\" alt=\"Pictiúr de phost Dave Forehead ar Facebook.\"><br><br> Ar an 28 Samhain, rinneadh admin de Darcy ar an leathanach Facebook agus thug XtremeNolaner úinéireacht dó ar an server Discord. Rinneadh admin de Enwrong ar an dá ardán freisin. Tharla an chéad chruinniú foirne lá ina dhiaidh sin idir na ceithre admins agus na baill foirne nua, ar tairgeadh áit dóibh bunaithe ar chomh fada agus a bhí siad sa phobal agus cé chomh gníomhach agus a bhí siad. Ba iad Tully, Walshy agus Daithi. Rinneadh an cuntas twitter RLI ar an 30 Samhain.<br><br>Ba é an chéad chomórtas a beoshruthaigh RLI riamh ná ócáid ​​na Nollag 2v2 an 3 Nollaig, a bhuaigh Dry and Fusure. (San am sin bhí comórtais 'tiered' againn.) <br><br><img src=\"/assets/RLI-christmas-2v2-tournament-results.jpg\" alt=\"Scarbhileog de thorthaí an chomórtais.\"><br><br>Chuidigh an seó taispeána Dry vs McCluvin 1v1 le RLI a thabhairt ar aird daoine lasmuigh d’Éirinn den chéad uair is dócha, le cabhair ó DigitalBacon. Bhí Dry i gcónaí sa 10 imreoir is fearr ar chlár ceannais 1s sa domhan ag an am, agus bhí sí le feiceáil ar beoshruth JohnnyBoi."
    },
    "timeline-2018": {
        "en": "RLI became very active in 2018 as tournament after tournament was organised, nearly all of which were streamed, leading to faster growth for the community. RLI held a 6mans invitational tournament on the 19th of January, featuring the likes of Redeyes, Lawlurr, Mugg, Barzey, Mayday and Fusure (with blah coming in as a sub in the last match). This was also the first time an RLI event was won by a console player.<br><br> Barzey and Mayday became Operators on the 20th of January, but Mayday left shortly afterwards.<br><br> Team RLI (captained by Redeyes) took on Nixus' competitive team on the 24th of January, however the RLI team had barely played together and unfortunately lost.<br><br> RLI opened staff applications on the 13th of February, after which Pandaa, CaptainQwark and ItsJustAbe became Moderators. bNy became a graphic designer for RLI and 1Junior1 became a streamer.<br><br> RLI uploaded to their YouTube channel for the first time on the 25th of February with highlights of it's first ever 12 Titans tournament. They continued to post highlight videos and a couple of podcasts for a brief amount of time afterwards.<br><br> The RLI-Helper bot was introduced to the Discord server on the 10th of March, as Dave Forehead had gotten fed up with having to give people new roles in the server on a constant basis.<br><br> bNy made the RLI logo on the 26th of May, and the community was formally renamed from Rocket League Ireland to RL Ireland.<br><br> On the 24th of June, the <a href=\"https:\/\/liquipedia.net/rocketleague/RL_Ireland/Q-CON/2018\">Q-Con 2v2 LAN</a> took place in Belfast, which was considered a massive success. Mugg and Fusure won with Dry and Crungus came second. Dave Forehead and Tully did most of the commentating on the day with the occasional interview and guest caster throughout the day. Darcy adminned the event, with help from Dannyboy. RLI merchandise was available for the first time at this point, with black and white hoodies and t-shirts on offer. <br><br><img src=\"/assets/RLI-belfast-lan-picture.jpg\" alt=\"A picture of everyone from the Q-Con LAN together.\"><br><br> Redeyes won the Seasonal Elite Championship on the 13th of July. The concept of the tournament (attributed to Enwrong) was that a player's performance in the tournament was converted to points, and the top 6 played a 6mans tournament to decide a winner.<br><br> The Dublin Games Festival (DGF) LAN took place on the 24th of November, with The Dubliners, consisting of ItsPureLogic, Mugg and Fusure, winning and Aviators, made up of Enwrong, Pandaa and Durkan, coming second in a final that finished a minute before the internet would be turned off. Dave Forehead adminned the event, and ran a last minute stream off of his computer.<br><br> <img src=\"/assets/picture-of-dgf-lan.jpg\" alt=\"A picture of the DGF LAN with people at the computers playing.\"><br><br> On the 7th of December, Redeyes became our Seasonal Elite Champion for the second time in a row.",
        "ga": "Bhí RLI an-ghníomhach in 2018 mar eagraíodh comórtas i ndiaidh comórtas, agus rinneadh beagnach gach ceann díobh a beoshruthú, rud a chiallaigh go raibh fás níos gasta ag an bpobal. Reáchtáil RLI comórtas cuirí 6mans ar an 19 Eanáir, ina raibh leithéidí Redeyes, Lawlurr, Mugg, Barzey, Mayday agus Fusure (le blah ag teacht isteach mar fho sa chluiche deireanach). Ba é seo an chéad uair freisin a bhuaigh imreoir consól imeacht RLI.<br><br>Tháinig Barzey agus Mayday mar Oibreoirí ar an 20 Eanáir, ach d’imigh Mayday go gairid ina dhiaidh sin.<br><br>Ghlac Foireann RLI (faoi cheannas Redeyes) foireann iomaíoch Nixus ar an 24 Eanáir, ach is ar éigean a d’imir foireann RLI le chéile agus ar an drochuair chaill siad.<br><br>D'oscail RLI iarratais foirne ar an 13 Feabhra, agus ina dhiaidh sin rinneadh Pandaa, CaptainQwark agus ItsJustAbe mar Mhodhnóirí. Bhí bNy ina dearthóir grafach do RLI agus rinneadh 1Junior1 de shreangóir.<br><br> Uaslódáil RLI ar a gcainéal YouTube den chéad uair ar an 25 Feabhra le buaicphointí a chéad chomórtais 12 Titans riamh. Lean siad orthu ag postáil físeáin buaicphointí agus cúpla podchraoladh le haghaidh achoimre an méid ama ina dhiaidh sin. <br><br>Tugadh an bot RLI-Helper isteach don fhreastalaí Discord ar an 10 Márta, toisc go raibh Dave Forehead bréan de bheith ag iarraidh róil nua a thabhairt do dhaoine ar an server ar bhonn leanúnach.<br><br>Rinne bNy lógó RLI ar an 26 Bealtaine, agus athainmníodh an pobal go foirmiúil ó Rocket League Ireland go RL Ireland.<br><br>Ar an 24 Meitheamh, tharla an <a href=\"https:\/\/liquipedia.net/rocketleague/RL_Ireland/Q-CON/2018\">Q-Con 2v2 LAN</a> i mBéal Feirste, a measadh a bheith ollmhór rath. Bhuaigh Mugg agus Fusure le Dry agus tháinig Crungus sa dara háit. Dave Forehead agus Tully a rinne an chuid is mó den tráchtaireacht an lá leis an agallamh ócáideach agus an t-aoi caster i rith an lae. Bhí meas ag Darcy ar an ócáid, le cabhair ó Dannyboy. Bhí earraí RLI ar fáil den chéad uair ag an bpointe seo, le cochaill dubh agus bán agus t-léinte ar fáil. <br><br><img src=\"/assets/RLI-belfast-lan-picture.jpg\" alt=\"Pictiúr de gach duine ón Q-Con LAN le chéile.\"><br><br>Bhuaigh Redeyes an Craobh Séasúrach Mionlach ar an 13 Iúil. Ba é coincheap an chomórtais (curtha i leith Enwrong) gur athraíodh feidhmíocht imreoir sa chomórtas go pointí, agus d’imir an 6 barr comórtas 6mans go buaiteoir a chinneadh.<br><br>Bhí LAN Féile Cluichí Bhaile Átha Cliath (DGF) ar siúl ar an 24 Samhain, le The Dubliners, comhdhéanta de ItsPureLogic, Mugg and Fusure, a bhuaigh agus Aviators, comhdhéanta de Enwrong, Pandaa agus Durkan, ag teacht sa dara háit i gcluiche ceannais a chríochnaigh nóiméad sula ndéanfaí an t-idirlíon a mhúchadh. Bhí meas ag Dave Forehead ar an ócáid, agus rith sé sruth nóiméad deireanach as a ríomhaire. <br><br> <img src=\"/assets/picture-of-dgf-lan.jpg\" alt=\"Pictiúr den DGF LAN le daoine ag na ríomhairí ag imirt.\"><br><br>Ar an 7 Nollaig, rinneadh Redeyes mar ár gCraobh Mionlach Séasúrach den dara huair as a chéile."
    },
    "timeline-2019": {
        "en": "Enwrong started the 6mans league again on the 8th of January, which turned out to be much more successful than his previous attempt back in 2016, with over 30 participants and 4 divisions. Demoqz won it the first month.<br><br> RLI-Times was introduced on the 7th of February, a text channel within the Discord server run by Ghost and Blah that posted about what was going on in the RLI server from time to time.<br><br> RLI announced on the 8th of March that it planned to host it’s own LAN event for the first time ever in a gaming bar down in Cork.<br><br> On the 13th of March, Tully got demoted from Operator while Pandaa was promoted to Operator. On the 16th, carrickdan and John_Aka_Alwayz got promoted to Moderator, and RLI opened its Moderator applications for the second time. Captain Qwark left the staff team on the 6th of April to focus on exams<br><br> On the 7th of April, RLI was officially announced as European Games Week's Rocket League partner for their LAN event in June.<br><br> Daithí and Barzey left the staff team to focus on exams on the 8th of April.<br><br> RLI held it's first ever self-run LAN event on the 20th of April. Suitably called the RLI LAN, it took place in the 365itHub in Cork. It was a 3v3 LAN with 12 teams entering. Joseph (with help from Walshy) ran the event. Lynxi took a lot of photos for himself and for RLI. Dave Forehead and NuaLaoch casted the event with people coming in for casual interviews now and again. Most importantly, the event was won by FML, consisting of Fusure, Mugg and ItsPureLogic, with Yurt (Walshy, Adzer and Demoqz) coming second and Nuclear Storm Gaming (Enwrong, Arctic and Pandaa) coming third. Adzer was named MVP of the tournament and Pat. was given the Redeyes Redemption award, for playing the most above expectations, funded by JToPrey (who won a giveaway on Redeyes' stream, hence the name).<br><br> Carrickdan and John_aka_Alwayz got promoted to Operator on the day as well. Shortly after, LovelyCans, Demoqz and LTXSam were made Moderators.<br><br> <img src=\"/assets/rli-lan.jpeg\" alt=\"A picture of the RLI LAN\"><br><br> Mugg was announced as the 6mans Season 2 winner on the 25th of April. Walshy left the staff team on the same day after being with them for over a year.<br><br> On the 3rd of May, the Discord server reached the 500 member mark.<br><br> Redeyes became the third 6mans winner on the 5th of June.<br><br> Enwrong started a new 2v2 league that ran alongside the 6mans league on the 10th of June. The 4th season of 6mans started on the 13th, with Dave Forehead and John_aka_Alwayz in charge of it this time, instead of the usual Enwrong. A group of 6mans moderators helped them run it as before.<br><br>On the 14th of June, Dave Forehead updated the RLI Helper Bot so that it wouldn’t drop offline randomly.<br><br>On the 18th of June, Dave Forehead announced that RLI would enter ERLS (later renamed to IEL – Imperial Esports League).<br><br>On the 19th of June, Carrickdan decided to leave the RLI staff team.<br><br>On the 30th of June, RLI announced that it’d be helping run the RL tournament at Q-con XXVI.<br><br>On the 9th of July, Walshy and Redeyes were announced as the first of RLIs 2v2 league winners.<br><br>Signups for Season 2 of the 2v2 league were announced on the 13th of July, along with the major news that NSG would sponsor the top tier of the league, meaning the winners of Season 2 would be taking €50 as a prize.<br><br>JKee became the sole member of RLI’s media team on the 17th of July.<br><br>Jxffa became the 6mans Season 4 champion on the 27th of July.<br><br>RLI announced on the 29th of July that they would be helping Insomnia run a LAN.<br><br> On the 2nd of August, Enwrong and John_aka_Alwayz realised that Dave Forehead was onto something with the whole \"preserving history\" thing and made Liquipedia pages for <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Q-CON/2018\">Q-Con 2018</a>, <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/DGF\">DGF 2018</a> and <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/LAN_Cork/2019\">RLI LAN 2019</a>.<br><br> On the 5th of August, Dave Forehead added the RLI logo as an emote to the Discord server.<br><br>On the 7th of August, LovelyCans was promoted to Operator and Jxffa was promoted to Moderator.<br><br>On the 21st of August, Insomnia Dubin confirmed they were having a Rocket League tournament at their event. <br><br>On the 1st of September, <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Q-CON/2019\">Q-Con 2019</a> took place. Mugg & Fusure won the competition, with Redeyes and late sub Enwrong coming second. Enwrong adminned the event with help from Dave Forehead and a host of other members of the RLI staff team.<br><br><img src=\"/assets/q-con-2019.jpg\" alt=\"A picture of Q-Con 2019\"><br><br>A server rules channel was officially introduced into the Discord server on the 7th of September.<br><br> Demoqz left the staff team on the 9th of September.<br><br>EGW was cancelled on the 13th of September. It was a massive moment for esports in Ireland and Europe that year, sending shockwaves not just through RLI but through esports across the country. No-one was quite sure what would happen.<br><br>However, class acts, full time legends and absolute heroes Enwrong and Dave Forehead ensured that the Rocket league event from EGW wasn’t cancelled and instead took place in a gaming cafe that was owned by the EGW event organisers, meaning that those who paid for accommodation, travel and tickets still had something to look forward to.<br><br>The 5th season of RLI 6mans came to an end on the 19th of September with Mugg becoming the first and only two-time Premier champion. <br><br>Later that day, Barzey returned to the staff team as Moderator, along with Luachra. <br><br>The re-named <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Giga-Bite_Cafe_LAN\">Giga-byte LAN</a> took place on the 21st of September. Adzer, Ryan and Virtuoso all won their first ever LAN event, defeating LAN regulars Mugg, Fusure and Blah in the final. The fully foreign team of sadGreen, Messy.DD and Thieu.DD came third.<br><br>John_aka_Alwayz and Dave Forehead adminned the event, with Enwrong and Nualaoch casting the day’s action.<br><br><img src=\"/assets/giga-byte-lan.jpg\" alt=\"A picture of players playing at the Giga-Byte LAN\"><br><br>RLI’s 1s league was announced on the 23rd of September, meant to replace the old 6mans.<br><br>Community games night was introduced on the 4th of October. Run by new Moderators Barzey and Luachra, a games night happened roughly every fortnight and it was designed to encourage newer people in the server to get to know everyone better.<br><br> Carrickdan started RLI Weekly on the 14th of October, a parody weekly newsletter that commented on the weekly goings-on in the server, primarily focusing on the beef and drama caused by the members.<br><br>RLI’s seasonal 2v2 tournament took place on the 20th of October. Ghost and Jakey beat Shallow and Weetabix in the Tier 1 final, while the Tier 2 final was won by Ryan and Roadman John over AdequateLlama and Poggs.<br><br>On the 27th of October, RLI’s master IEL team, consisting of Jxffa, Walshy, Fusure, and LovelyCans as sub, won in the Grand Finals. Later, the challenger team, consisting of Luachra, Littledude37, Kipp and Ruffs as sub, made it to the Grand finals but sadly couldn’t repeat the same result as the master team.<br><br> RLI’s new major league was announced on the 1st of November, called RLI Superstars, or RLIS. The main idea of RLIS was to incorporate 1s, 2s and 3s all into the one league.<br><br><a href=\"https://liquipedia.net/rocketleague/Insomnia_Dublin\">Insomnia Dublin</a> took place on the 9th of November, becoming a record-breaking 4th LAN in the same year for RLI. Mugg, Fusure and Virtuoso took 1st place, with Virtuoso taking MVP as well. Demoqz, JKee and Classy took an arguably surprising 2nd place also. Enwrong adminned the event, and he was assisted by John_aka_Alwayz and LTXSam. Dave Forehead casted the day’s action, joined by Enwrong for the final.<br><br>Darcyyyy stepped down from Admin to Moderator on the 16th of November.<br><br>As part of RLI’s end-of-year announcement on the 31st of December, Luachra was promoted to Operator.",
        "ga": "Chuir Enwrong tús le sraithe 6mans arís ar an 8ú d’Eanáir, ar éirigh go maith leis ná mar a rinne sé roimhe seo ar ais i 2016, le níos mó ná 30 rannpháirtí agus 4 rannán. Bhuaigh Demoqz é an chéad mhí.<br><br>Tugadh RLI-Times isteach ar an 7ú Feabhra, cainéal téacs laistigh den fhreastalaí Discord arna reáchtáil ag Ghost and Blah a phostáil faoina raibh ar siúl i server RLI ó am go ham.<br><br>D’fhógair RLI an 8 Márta go raibh sé beartaithe acu a ócáid ​​LAN féin a óstáil den chéad uair riamh i mbeár cearrbhachais síos i gCorcaigh.<br><br>Ar an 13ú Márta, díbríodh Tully ón Oibreoir agus tugadh ardú céime do Pandaa mar Oibreoir. Ar an 16ú, fuair carrickdan agus John_Aka_Alwayz ardú céime go Moderator, agus d’oscail RLI a fheidhmchláir Moderator den dara huair. D’fhág an Captaen Qwark an fhoireann foirne ar an 6 Aibreán chun díriú ar scrúduithe<br><br>Ar an 7 Aibreán, fógraíodh RLI go hoifigiúil mar chomhpháirtí Rocket League Sheachtain na gCluichí Eorpacha dá n-imeacht LAN i mí an Mheithimh.<br><br>D’fhág Daithí agus Barzey an fhoireann foirne chun díriú ar scrúduithe ar an 8 Aibreán.<br><br>Reáchtáil RLI a chéad imeacht LAN féin-reáchtáil riamh ar an 20 Aibreán. Ar a dtugtar an RLI LAN go hoiriúnach, tharla sé sa 365itHub i gCorcaigh. LAN 3v3 a bhí ann le 12 fhoireann ag dul isteach. Reáchtáil Joseph (le cabhair ó Walshy) an ócáid. Thóg Lynxi a lán grianghraf dó féin agus do RLI. Chuir Dave Forehead agus NuaLaoch an ócáid ​​i láthair le daoine ag teacht isteach le haghaidh agallaimh ócáideacha anois is arís. Níos tábhachtaí fós, bhuaigh FML an ócáid, ar a raibh Fusure, Mugg agus ItsPureLogic, le Yurt (Walshy, Adzer agus Demoqz) ag teacht sa dara háit agus Cearrbhachas Stoirme Núicléach (Enwrong, Artach agus Pandaa) sa tríú háit. Ainmníodh Adzer mar MVP den chomórtas agus Pat. Bronnadh duais Fuascailte Redeyes air, as na hionchais is airde thuas a imirt, arna mhaoiniú ag JToPrey (a bhuaigh bronntanas ar shruth Redeyes, mar sin an t-ainm).<br><br>Fuair ​​Carrickdan agus John_aka_Alwayz ardú céime mar Oibreoir ar an lá freisin. Go gairid ina dhiaidh sin, rinneadh Modhnóirí de LovelyCans, Demoqz agus LTXSam. <br><br> <img src=\"/assets/rli-lan.jpeg\" alt=\"Pictiúr den RLI LAN\"><br><br>Fógraíodh Mugg mar bhuaiteoir Séasúr 2 6mans ar an 25 Aibreán. D'fhág Walshy an bhfoireann an lá céanna tar éis dóibh a bheith in éineacht leo le breis agus bliain. <br><br>Ar an 3ú Bealtaine, shroich an server Discord an marc 500 ball.<br><br>Ba é Redeyes an tríú buaiteoir 6mans ar an 5ú Meitheamh.<br><br>Chuir Enwrong tús le sraithe nua 2v2 a rith taobh le sraithe 6mans ar an 10ú Meitheamh. Thosaigh an 4ú séasúr de 6mans ar an 13ú, le Dave Forehead agus John_aka_Alwayz i gceannas air an uair seo, in ionad an Enwrong is gnách. Chabhraigh grúpa modhnóirí 6mans leo é a reáchtáil mar a rinneadh cheana.<br><br>Ar an 14ú Meitheamh, rinne Dave Forehead an RLI Helper Bot a nuashonrú ionas nach dtitfeadh sé as líne go randamach.<br><br>Ar an 18ú i mí an Mheithimh, d’fhógair Dave Forehead go rachadh RLI isteach in ERLS (a athainmníodh ina dhiaidh sin go IEL - Imperial Esports League).<br><br>Ar an 19 Meitheamh, chinn Carrickdan foireann foirne an RLI a fhágáil.<br><br>Ar an 30 Meitheamh, d’fhógair RLI go mbeadh sé ag cabhrú le comórtas RL a reáchtáil ag Q-con XXVI.<br><br>Ar an 9 Iúil, fógraíodh Walshy agus Redeyes mar an chéad cheann de bhuaiteoirí sraithe 2L2 RLIs. <br><br>Fógraíodh sínithe do Séasúr 2 den tsraith 2v2 ar an 13 Iúil, mar aon leis an nuacht mhór go ndéanfadh NSG urraíocht ar shraith uachtarach na sraithe, rud a chiallaíonn go mbeadh buaiteoirí Séasúr 2 ag glacadh € 50 mar dhuais. <br><br>Tháinig JKee chun bheith ina bhall aonair d’fhoireann meán RLI ar an 17 Iúil.<br><br>Tháinig Jxffa chun bheith ina churadh Séasúr 4 6mans ar an 27 Iúil.<br><br>D'fhógair RLI an 29 Iúil go mbeidís ag cabhrú le Insomnia LAN a reáchtáil.<br><br>Ar an 2 Lúnasa, thuig Enwrong agus John_aka_Alwayz go raibh Dave Forehead ar rud éigin leis an rud iomlán “ag caomhnú na staire” agus rinne siad leathanaigh Liquipedia do <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Q-CON/2018\">Q-Con 2018</a>, <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/DGF\">DGF 2018</a> agus <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/LAN_Cork/2019\">RLI LAN 2019</a>.<br><br>Ar an 5 Lúnasa, chuir Dave Forehead lógó RLI mar emote leis an server Discord.<br><br>Ar an 7 Lúnasa, tugadh LovelyCans chun cinn mar Oibreoir agus tugadh Jxffa chun cinn mar Mhodhnóir.<br><br>Ar an 21 Lúnasa, dheimhnigh Insomnia Dubin go raibh comórtas Rocket League á reáchtáil acu ag a n-imeacht. <br><br>Ar an 1 Meán Fómhair, <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Q-CON/2019\">Q-Con 2019</a> ar siúl. Bhuaigh Mugg & Fusure an comórtas, le Redeyes agus sub Enwrong déanach sa dara háit. Chuir Enwrong meas ar an ócáid ​​le cabhair ó Dave Forehead agus a lán ball eile d’fhoireann foirne RLI.<br><br><img src=\"/assets/q-con-2019.jpg\" alt=\"Pictiúr de Q-Con 2019\"><br><br>Tugadh cainéal rialacha server isteach go hoifigiúil sa fhreastalaí Discord ar an 7 Meán Fómhair.<br><br>D’fhág Demoqz an fhoireann foirne ar an 9 Meán Fómhair.<br><br>Cuireadh EGW ar ceal an 13 Meán Fómhair. Ba mhór an nóiméad é do esports in Éirinn agus san Eoraip an bhliain sin, ag seoladh turraingí ní amháin trí RLI ach trí esports ar fud na tíre. Ní raibh aon duine cinnte cad a tharlódh.<br><br>Mar sin féin, chinntigh gníomhartha ranga, finscéalta lánaimseartha agus laochra iomlána Enwrong agus Dave Forehead nár cuireadh imeacht sraithe Rocket ó EGW ar ceal agus gur tharla sé i gcearrbhachas caife a bhí faoi úinéireacht eagraithe imeachtaí EGW, rud a chiallaíonn go raibh rud éigin le súil go fóill leo siúd a d’íoc as cóiríocht, taisteal agus ticéid. <br><br>Tháinig deireadh leis an 5ú séasúr de RLI 6mans ar an 19 Meán Fómhair le Mugg ar an gcéad agus an t-aon curadh Premier dhá uair.<br><br>Níos déanaí an lá sin, d’fhill Barzey ar an bhfoireann foirne mar Mhodhnóir, in éineacht le Luachra. <br><br>Tharla an athainmniú <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Giga-Bite_Cafe_LAN\"> Giga-byte LAN </a> an 21 Meán Fómhair. Bhuaigh Adzer, Ryan agus Virtuoso go léir a gcéad imeacht LAN riamh, ag dul i gcoinne rialtóirí LAN Mugg, Fusure agus Blah sa chluiche ceannais. Tháinig foireann iomlán eachtrach sadGreen, Messy.DD agus Thieu.DD sa tríú háit.<br><br>Bhí meas ag John_aka_Alwayz agus Dave Forehead ar an ócáid, le Enwrong agus Nualaoch ag caitheamh gníomh an lae.<br><br><img src=\"/assets/giga-byte-lan.jpg\" alt=\"Pictiúr d’imreoirí a bhí ag imirt ag an Giga-Byte LAN\"><br><br>Sraith 1s RLI ar an 23 Meán Fómhair, agus é i gceist é a chur ina ionad na sean-6mans. <br><br>Tugadh oíche cluichí pobail isteach ar an 4 Deireadh Fómhair. Reáchtáil Moderator Barzey agus Luachra nua, tharla oíche cluichí go garbh gach coicís agus dearadh í chun daoine nua sa fhreastalaí a spreagadh chun aithne níos fearr a chur ar gach duine.<br><br>Chuir Carrickdan tús le RLI Weekly ar an 14 Deireadh Fómhair, nuachtlitir seachtainiúil parody a rinne trácht ar na himeachtaí seachtainiúla sa fhreastalaí, ag díriú go príomha ar an mairteoil agus an drámaíocht a bhíonn mar thoradh ar na baill.<br><br>Bhí comórtas séasúrach 2v2 RLI ar siúl ar an 20 Deireadh Fómhair. Bhuail Ghost agus Jakey Shallow agus Weetabix i gcluiche ceannais Leibhéal 1, agus bhuaigh Ryan agus Roadman John cluiche ceannais Leibhéal 2 thar AdefficientLlama agus Poggs. <br><br>Ar an 27 Deireadh Fómhair, bhuaigh máistirfhoireann IEL RLI, ar a raibh Jxffa, Walshy, Fusure, agus LovelyCans mar fho, sna Grand Finals. Níos déanaí, rinne foireann an iomaitheora, ar a raibh Luachra, Littledude37, Kipp agus Ruffs mar fho, iad chuig na cluichí ceannais Grand ach faraor níorbh fhéidir leo an toradh céanna leis an máistirfhoireann a athdhéanamh.<br><br>Fógraíodh mórchomórtas nua RLI an 1 Samhain, ar a dtugtar RLI Superstars, nó RLIS. Ba é príomhsmaoineamh RLIS 1s, 2s agus 3s go léir a ionchorprú san aon léig amháin.<br><br><a href=\"https://liquipedia.net/rocketleague/Insomnia_Dublin\"> ghlac Insomnia Dublin </a> áit ar an 9 Samhain, agus é ina 4ú LAN den scoth sa bhliain chéanna do RLI. Bhí Mugg, Fusure agus Virtuoso sa chéad áit, le Virtuoso ag glacadh MVP freisin. Is féidir argóint a dhéanamh go raibh Demoqz, JKee agus Classy sa 2ú háit freisin. Bhí meas ag Enwrong ar an ócáid, agus fuair John_aka_Alwayz agus LTXSam cúnamh dó. Chuir Dave Forehead gníomh an lae i láthair, in éineacht le Enwrong don chluiche ceannais.<br><br>D'éirigh Darcyyyy as an Riarachán go dtí an Modhnóir ar an 16 Samhain.<br><br>Mar chuid d'fhógra deireadh bliana RLI ar an 31 Nollaig, tugadh ardú céime do Luachra mar Oibreoir."
    },
    "timeline-2020": {
        "en": "RLI’s second ever independent LAN, set to take place in Ballymena, was announced on the 3rd of January.<br><br>RLI’s winter 3v3 tournament took place on the 25th of January, with a record breaking 0 DQ’s throughout the day. Redeyes, Walshy and Shallow took the win over Demoqz, Arctic and Pandaa. In Tier 2 Ryan, BigBallsBrowne and Ruffs beat AdequateLlama, Spf and Pokewithastick in the final.<br><br>The first season of <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_1\">RLIS</a>                finished on the 26th of January.<br><br>Squid-G and Ryan were made Moderators on the 16th of February.<br><br>RLI’s <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RL_Ireland%27s_Ballymena_LAN_2020\">Ballymena LAN</a> took place on the 29th of February. NSG (Arctic, Pandaa and Demoqz - shouted at by Enwrong in the final) won 4 - 2, beating Mugg, Fusure and JKee in the final with Arctic taking the MVP award.<br><br> Dave Forehead casted the majority of the tournament with Nailer, John_aka_Alwayz ran the event and new staff member Squid-G took pictures<br><br><img src=\"/assets/ballymena-lan.jpg\" alt=\"A picture of everyone at the Ballymena LAN><br><br>RLI’s Dropshot Special took place on the 15th of March. S E V E N, Adzer and Hiccup won it, with Fassbendered, Lapsley and JaRyan coming second.<br><br>RLI’s first ever table quiz happened on the 22nd of March.<br><br>RLI’s <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_4 \"><br><br>4th Twelve Titans</a> event came to an end on the 29th of March with Ineffable beating Robkiernxn in a spectacularly high-quality final.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_2 \">RLIS Season 2</a> came to an end on the 3rd of April.<br><br> LovelyCans said “xD\" 1000 times in the server by the 10th of April. There was an announcement made about this for some bizarre reason, and he felt the need to tag everyone about it, which I suppose would be a very Cans thing to do. Obviously, such a monumental achievement must be recorded here.<br><br>Squid-G announces the addition of the custom games section to the RLI server on the 12th of April, a place for setting up modded games in RL.<br><br>The first <a href=\"https://liquipedia.net/rocketleague/RLIreland/Irish_Elite_Cup/1\">Irish Elite Cup</a>                (IEC) took place on the 2nd of May, with Robkiernxn, Mugg and Shallow winning it.<br><br>The <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Spring_2020/2v2\">RLI Spring 2v2</a> tournament took place on the 3rd of May, with Story Bud (Mugg & Robkiernxn) winning tier 1 and The Ladaroos (Fassbendered & Fine) winning the 2nd tier.<br><br> RLI opened up staff applications on the 4th of May to everyone in the server in order to expand the staff team to match the growth of the server.<br><br>RLI took on 7 new staff members on the 9th of May. Mul, Gillzo, Aidan, Lynsk, JaRyan and Wazzito all became moderators. Res, due to his hard work on the RLIS spreadsheet immediately became an operator, and Ryan was also promoted to operator. RLI founder, Darcy, decided to leave the staff team.<br><br>Later that day, the second <a href=https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/2>IEC</a> took place with Mugg, Robkiernxn and APS taking the win.<br><br>The third <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/3\">IEC</a> took place on the 16th of May with 3 new winners in Arctic, Pandaa and Pengu. <br><br>Dave Forehead brought out an update to the RLI Helper on the 18th of May that introduced the >me and >vintage_dyk commands and also updated the >dyk command to show slightly more updated facts.<br><br> The fourth <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/4\">IEC</a>                took place on the 23rd of May with Pandaa, Adzer and Ryan winning. <br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_3\">RLIS Season 3</a> came to an end on the 31st of May with the winners being: <br><br>RLI entered IEL Season 6 on the 9th of June<br><br>The RLI discord server hit 800 members on the 18th of June and to celebrate Barzey kickstarted the community games night once again.<br><br>Maydayyy, Mugg and Robkiernxn won the sixth <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/6\">IEC</a>                tournament on the 20th of June.<br><br>RLI announced its <a href=\"https://www.patreon.com/rlireland\">patreon</a> page on the 24th of June. There were 3 tiers: Johnstown, Tipp and North Dublin.<br><br> The RLI 6mans bot was remade on the 28th of June.<br><br>The 7th <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/7\">IEC</a> took place on the 4th of July, won by Shallow, Spectre and Robkiernxn.<br><br>The RLI 6mans bot was updated on the 1st of August to have different tiers of 6mans queues.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_4\">RLIS Season 4</a> finished on the 3rd of August.<br><br>The RLI 1v1 Summer seasonal cup took place on the 9th of August. Robkiernxn took 1st place in the top tier and LovelyCans won in tier 2.<br><br>RLI won the IEL master title for a second time with LTXSam, EliteSpartan (now known as Shane) and Jxffa on the 16th of August. Winning made RLI the joint most successful team in IEL at that point.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/7\">IEC #7</a> was played after a brief absence on the 22nd of August, and Shallow, Spectre and Robkiernxn won.<br><br>A new IEC format was announced 24th of August. The new format made players play in a playoffs stage before the main event, whereas before IEC was just a one-day event.<br><br>At the same time, Jxffa and Gillzo left the staff team.<br><br> RLI announced on the 26th of August it’s one of a kind merch, RLI face masks.<br><br>John_aka_Alwayz announced on the 28th of August that he had put the top tier of RLIS seasons 1-4 on Liquipedia.<br><br>The final phase of <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/8\">IEC #8</a>                took place on the 7th of September with Yem, Demoqz and Maydayyy winning. <br><br>RLIS Season 5 was announced on the 8th of September, and at the same time GraHa was made a moderator.<br><br>The final stage of <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/9\">IEC #9</a>                took place on the 21st of September with Wazzito, Colin and Littledude as the winners. <br><br>RLI ran the Autumn Solo-standard Seasonal Cup on the 24th of October. The winners were Aidan, JToPrey and Domhnaill.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_5\">RLIS season 5</a> came to a close on the 19th of November with no sign of another RLIS. <br><br>After 2 qualifiers and playoffs with 4 gatekeepers, Ineffable became champion of <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_5\">RLI 12 Titans Season 5</a> on the 22nd of November.<br><br>Luachra decided to leave the staff team from his operator position on the 26th of November. He apparently did nothing anyway.<br><br>RLI announced on the 2nd of December that it was going to enter Templar League’s 2s league, a league very similar to IEL. The teams were to be managed by LovelyCans, with Dave Forehead as an assistant.<br><br>An international showmatch between Esports Wales and Ireland Esports took place over 3 different esport games on the 5th of December. Pandaa, Shallow and Spectre represented Ireland Esports in Rocket League and won 3-1.<br><br> RLI hosted its 2v2 Holiday Hoops tournament on the 6th of December, with Ryan and Adzer making themselves kings of the dunk house.<br><br>Enwrong announced on the 8th of December that signups were open for the RLI Super Omega Ultimate Cup, a name which Dave Forehead took huge issue with for some reason. The Super Omega Ultimate Cup was one of the largest online tournaments RLI had ever hosted in terms of prize pool size and it was intended to boost people’s interest in the game over the holidays considering the unfortunate lack of LAN events in 2020.<br><br>Aidan left the staff team on the 16th of December, followed by LTXSam on the 19th.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Super_Omega_Ultimate_Cup\">RLI’s Super Omega Ultimate Cup</a> (SOUC) started on the 27th of December, with the 3s event. SOUC was a 2-day event where individuals won points based on where they finished in a 3s tournament and a 2s tournament, with the top 6 getting a cash prize. The 3s tournament was won by Yurt (Redeyes, Demoqz, Future), and in 2nd place came Doggery (Arctic, Pandaa, Ineffable). The 2s event took place the day after and was won by Well Bai (Shallow and Ineffable), who beat finalists Yemoqz (Yem, Demoqz).",
        "ga": "Fógraíodh an dara LAN neamhspleách riamh de chuid RLI, a bhí le bheith ar siúl i mBaile Meánach, an 3 Eanáir.<br><br>Bhí comórtas geimhridh 3v3 RLI ar siúl ar an 25 Eanáir, agus taifeadadh 0 DQ ar fud an lá. Ghlac Redeyes, Walshy agus Shallow an bua thar Demoqz, Artach agus Pandaa. I Sraith 2 bhuail Ryan, BigBallsBrowne agus Ruffs Ade leordhóthanachLlama, Spf agus Pokewithastick sa chluiche ceannais.<br><br>An chéad séasúr de Chríochnaigh <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_1\">RLIS</a>                ar an 26ú Eanáir.<br><br>Rinneadh Squid-G agus Ryan mar Mhodhnóirí ar an 16ú Feabhra.<br><br><a href=\"https://liquipedia RLI.net/rocketleague/RL_Ireland/RL_Ireland% 27s_Ballymena_LAN_2020\"> LAN an Bhaile Meánaigh </a> ar siúl ar an 29ú Feabhra. Bhuaigh NSG (Artach, Pandaa agus Demoqz - a ndearna Enwrong scairt orthu sa chluiche ceannais) 4 - 2, ag bualadh Mugg, Fusure agus JKee sa chluiche ceannais agus Artach ag glacadh an duais MVP.<br><br>Chaith Dave Forehead formhór an chomórtais le Nailer, reáchtáil John_aka_Alwayz an ócáid ​​agus thóg ball foirne nua Squid-G pictiúir<br><br><img src=\"/assets/ballymena-lan.jpg\" alt=\"A pictiúr de gach duine ag LAN an Bhaile Meánaigh\"><br><br> Tharla Dropshot Special de chuid RLI ar an 15ú Márta. Bhuaigh SEVEN, Adzer agus Hiccup é, agus Fassbendered, Lapsley agus JaRyan sa dara háit.<br><br>An chéad cheann de RLI tharla tráth na gceist boird riamh ar an 22 Márta.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_4\"><br><br> 4ú Dáréag Titans </a> tháinig deireadh le ócáid ​​ar an 29ú Márta le Ineffable ag bualadh Robkiernxn i gcluiche ceannais ardcháilíochta iontach.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_2\"> Tháinig deireadh le Séasúr 2 RLIS 2 </a>                ar an 3ú Aibreán.<br><br>Dúirt LovelyCans “xD” 1000 uair sa server faoin 10 Aibreán. Rinneadh fógra faoi seo ar chúis éigin aisteach, agus bhraith sé go gcaithfí gach duine a chlibeáil faoi, rud a cheapfainn a bheadh ​​an-Cans le déanamh. Ar ndóigh, caithfear a leithéid de ghnóthachtáil shéadchomhartha a thaifeadadh anseo.<br><br>Fógraíonn Squid-G go bhfuil rannán na gcluichí saincheaptha curtha leis an server RLI an 12 Aibreán, áit chun cluichí modded a bhunú i RL. <br><br> Tharla an chéad <a href=\"https://liquipedia.net/rocketleague/RLIreland/Irish_Elite_Cup/1\"> Corn Elite na hÉireann </a> (IEC) an 2 Bealtaine, le Robkiernxn, Mugg agus Shallow a bhuaigh é. <br><br> Bhí an comórtas <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Spring_2020/2v2\"> RLI Spring 2v2 </a>ar siúl ar an 3ú Bealtaine, le Story Bud (Mugg & Robkiernxn) ag buachan sraith 1 agus The Ladaroos (Fassbendered & Fine) ag buachan an 2ú sraith.<br><br>D'oscail RLI iarratais foirne ar an 4ú Bealtaine do gach duine sa server d’fhonn an fhoireann foirne a leathnú chun fás an fhreastalaí a mheaitseáil.<br><br>Ghlac RLI 7 mball foirne nua ar an 9 Bealtaine. Bhí Mul, Gillzo, Aidan, Lynsk, JaRyan agus Wazzito ina modhnóirí. Tháinig Res, mar gheall ar a chuid oibre crua ar scarbhileog RLIS, ina oibreoir láithreach, agus tugadh ardú céime d’Oibreoir freisin. Chinn bunaitheoir RLI, Darcy, an fhoireann foirne a fhágáil.<br><br>Níos moille an lá sin, tharla an dara <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/2\">IEC</a>le Mugg, Robkiernxn agus APS ag glacadh an bua.<br><br>Tharla an tríú <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/3\"> IEC </a> ar an 16 Bealtaine le 3 bhuaiteoir nua san Artach, Pandaa agus Pengu.<br><br>Thug Dave Forehead nuashonrú don Helper RLI an 18 Bealtaine a thug isteach na horduithe> me agus> vintage_dyk agus a rinne an t-ordú> dyk a nuashonrú freisin chun fíricí beagán níos nuashonraithe a thaispeáint.<br><br>An ceathrú <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/4\"> IEC </a> ar siúl ar an 23 Bealtaine le Pandaa, Adzer agus Ryan ag buachan.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_3\"> Tháinig Séasúr 3 RLIS chun deiridh ar an 31 Bealtaine agus ba iad na buaiteoirí:<br><br>Chuaigh RLI isteach i Séasúr 6 IEL ar an 9 Meitheamh<br><br>Bhuail server neamhord RLI 800 ball ar an 18ú Meitheamh agus chun Barzey a cheiliúradh chuir sé tús le hoíche na gcluichí pobail arís. > Bhuaigh Maydayyy, Mugg agus Robkiernxn an séú <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/6\">IEC</a>                ar an 20ú Meitheamh.<br><br>RLI d’fhógair sé a leathanach <a href=\"https://www.patreon.com/rlireland\"> patreon </a> ar an 24 Meitheamh. Bhí 3 shraith ann: Baile Sheáin, Tipp agus Baile Átha Cliath Thuaidh.<br><br>Rinneadh bot RLI 6mans a athchur ar an 28 Meitheamh.<br><br>Tharla an 7ú <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/7\"> IEC </a> ar an 4 Iúil, a bhuaigh Shallow, Specter agus Robkiernxn.<br><br>Nuashonraíodh bot RLI 6mans an 1 Lúnasa chun go mbeadh sraitheanna éagsúla de scuainí 6mans ann.<br><br>Chríochnaigh <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_4\"> Séasúr 4 RLIS ar an 3 Lúnasa.<br><br>Tharla cupán séasúrach an tSamhraidh RLI 1v1 ar an 9 Lúnasa. Bhí Robkiernxn sa chéad áit sa tsraith uachtarach agus bhuaigh LovelyCans i sraith 2.<br><br>Bhuaigh RLI máistir-theideal IEL den dara huair le LTXSam, EliteSpartan (ar a dtugtar Shane anois) agus Jxffa ar an 16 Lúnasa. Ba é RLI an fhoireann ar an bhfoireann is rathúla in IEL ag an bpointe sin.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/7\">IEC #7</a>                imríodh tar éis neamhláithreacht ghairid ar an 22 Lúnasa, agus bhuaigh Shallow, Specter agus Robkiernxn.<br><br>Fógraíodh formáid nua IEC an 24 Lúnasa. Chuir an fhormáid nua le himreoirí imirt i gcéim athsheinm roimh an bpríomhócáid, ach roimh imeacht aon lae amháin a bhí i IEC.<br><br>Ag an am céanna, d’fhág Jxffa agus Gillzo an fhoireann foirne.<br><br>D’fhógair RLI an 26 Lúnasa go bhfuil sé ar cheann de na daoine cineálta, maisc aghaidhe RLI.<br><br>D’fhógair John_aka_Alwayz an 28 Lúnasa go raibh an tsraith uachtarach de shéasúir RLIS 1-4 curtha aige ar Liquipedia.<br><br>Tharla an chéim dheiridh de <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/8\">IEC #8</a> ar an 7 Meán Fómhair agus bhuaigh Yem, Demoqz agus Maydayyy .<br><br>Fógraíodh Séasúr 5 RLIS an 8 Meán Fómhair, agus ag an am céanna rinneadh GraHa mar mhodhnóir.<br><br>An chéim dheiridh de <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_Elite_Cup/9\"> Bhí IEC # 9 </a>ar siúl ar an 21 Meán Fómhair le Wazzito, Colin agus Littledude mar bhuaiteoirí.<br><br>Reáchtáil RLI Corn Séasúrach Aonair an Fhómhair ar an 24 Deireadh Fómhair. Ba iad Aidan, JToPrey agus Domhnaill na buaiteoirí.<br><br>Tháinig <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/RLIS/Season_5\"> séasúr 5 RLIS chun deiridh an 19 Samhain gan aon chomhartha de RLIS eile.<br><br>Tar éis 2 cháilitheoir agus athsheinm le 4 gheataire, tháinig Ineffable chun bheith ina churadh ar <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_5\"> RLI 12 Titans Séasúr 5 </a>ar an 22 Samhain.<br><br>Chinn Luachra an fhoireann foirne a fhágáil óna post mar oibreoir ar an 26 Samhain. De réir cosúlachta ní dhearna sé aon rud ar aon nós.<br><br>D’fhógair RLI an 2 Nollaig go raibh sé chun dul isteach i léig 2s Templar League, sraithe atá an-chosúil le IEL. Bhí na foirne le bainistiú ag LovelyCans, le Dave Forehead mar chúntóir.<br><br>Taispeánadh sárthaispeántas idirnáisiúnta idir Esports Wales agus Ireland Esports thar 3 chluiche esport éagsúla ar an 5 Nollaig. Rinne Pandaa, Shallow and Specter ionadaíocht ar Ireland Esports i Rocket League agus bhuaigh siad 3-1.<br><br>D'óstáil RLI a chamchuairt Fonsaí Saoire 2v2 ar an 6 Nollaig, le Ryan agus Adzer ag déanamh ríthe dóibh féin den teach dunk.<br><br>D’fhógair Enwrong an 8 Nollaig go raibh sínithe oscailte do Chorn Deiridh Super Omega RLI, ainm a raibh ceist mhór ag Dave Forehead leis ar chúis éigin. Bhí an Corn Deiridh Super Omega ar cheann de na comórtais ar líne is mó a d’óstáil RLI riamh maidir le méid linn snámha duaiseanna agus bhí sé i gceist spéis daoine sa chluiche a mhéadú thar na laethanta saoire ag smaoineamh ar an easpa trua d’imeachtaí LAN in 2020. <br> <br> D’fhág Aidan an fhoireann foirne ar an 16 Nollaig, agus LTXSam ina dhiaidh sin ar an 19ú.<br><br> Thosaigh <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Super_Omega_Ultimate_Cup\">Super Omega Ultimate Cup RLI</a> (SOUC) an 27 Nollaig, leis an ócáid ​​3s. Ócáid 2 lá a bhí i SOUC inar bhuaigh daoine aonair pointí bunaithe ar an áit ar chríochnaigh siad i gcomórtas 3s agus i gcomórtas 2s, agus an 6 barr ag fáil duais airgid. Bhuaigh Yurt (Redeyes, Demoqz, Future) an comórtas 3s, agus sa 2ú háit tháinig Doggery (Artach, Pandaa, Ineffable). Bhí an ócáid ​​2s ar siúl an lá ina dhiaidh sin agus bhuaigh Well Bai (Shallow agus I) é neffable), a bhuaigh Yemoqz sa chluiche ceannais (Yem, Demoqz)."
    },
    "timeline-2021": {
        "en": "Dave Forehead made his traditional end of year announcement on the 1st of January by announcing that RLI were opening staff applications.<br><br>JengaBenga, Pokewithastick, Royzer, Coombs and Wrench all joined the staff team on the 15th of January. <br><br>The <a href=\"https://www.tiktok.com/@rl_ireland\">RL Ireland TikTok</a> account was made on the 18th of January, and the top 5 clips of the week were posted there on a (semi) regular basis. <br><br> The <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series\">Wylde Rocket Series</a>                (WRS) was announced on the 2nd of February. WRS was a series of monthly tournaments where teams earned points based on their finishes and the teams with the highest points qualified for the major event in June. The whole set of events was sponsored by the Irish based esports organisation Wylde. On an unrelated note (but on the same day) the RLI 6mans bot got its captains update. Players could now choose if they wanted the teams to be decided randomly by the bot or by captains. <br><br> The <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/February\">first WRS monthly</a> event took place on the 13th of February. Team (Shallow, Spectre and Aenia) took the win over Carbon Zero (Shane, Lynsk, Futura). <br><br>RLI Madra, one of RLI’s five Templar League teams won the Knights Division on the 20th of February. GraHa and Bonkersbott made it happen in the playoffs, Anthony played a crucial role during the season, and Dave Forehead was there to provide the water and orange slices.<br><br>It was 2/4 for RLI in Templar League as RLI Sneachta, LTXSam and Dlynch, delivered the goods to win the Kings division, with Fassbendered playing his part through-out the season as well.<br><br>The 2v2 Spring Cup took place on the 27th of February, an unusual cup for RLI as it was only open to players C3 or lower. UwU Stepdad (Wrench and Aaron) won the event against Oaties (CaptainQwark and Dimitrov) in the final.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/March\">WRS Monthly #2</a> took place on the 14th of March with DogWithALog (Yem, Colin, HammerSt – as it would turn out, Wazzito was secretly playing on HammerSt’s account) taking it in the final against Me and the Boys (Robkiernxn, Shallow and Halden).<br><br>The first ever Challenge the Staff event took place on the 20th of March. There were 3 tiers of staff teams for members of the community to challenge. The staff teams earned a 100%-win record over the community.<br><br>The RLI discord server hit 1000 members on the 1st of April. No, this is not a joke.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_6\">12 Titans S6</a>                took place on the 4th of April with Shallow surprising many to take the top spot over Colin in the final. Ineffable said on the day, “What did you have for breakfast?\" and Shallow famously replied “Easter egg\".<br><br> IEL Season 8 came to a close on the 18th of April with the Master, Challenger and Prospect teams all making playoffs. The Prospect team had the best run, getting to the semi-finals. Coombs also left the staff team on this day.<br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/April\">WRS Monthly #3</a> took place on the 25th of April with Me and the Boys (Robkiernxn, Spectre and Shallow) getting revenge over DogWithALog (Yem, Colin and HammerSt/Wazzito).<br><br>JaRyan left the staff team on the 1st of May, followed by Ryan on the 6th, and then Wrench on the 18th.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/May\">WRS Monthly #4</a>                took place on the 23rd of May with new winner Carbon Zero (Shane, Futura and NKS) beating Hoovers (Smokez, Trace (formerly Cian) and Staar) in the final.<br><br>The Seasonal Solo Standard cup took place on the 30th of May with LTXSam, Finbarr and barmanitan winning in the final against Mul, Gillzo and P1ayer 0n3.<br><br> The original <a href=\"https://docs.google.com/document/d/1oW8iqr8yDmqB2GQdnPGQaZ48TGfP0UFd122TOVHryPg/edit?usp=sharing\">history book</a> was updated on the 3rd of June, as Dave Forehead had grown lazy, leaving Lynsk to pick up the slack.<br><br>Wylde and RLI partnered up for a giveaway on the 11th of June. The winners would receive some lovely Wylde merch when the draw happened after WRS Monthly #5.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/June\">WRS Monthly #5</a> took place on the 13th of June, with Me and the Boys (Shallow, Robkiernxn and Spectre) taking the win over DogWithALog (Colin, Yem and HammersSt/Wazzito). Afterwards, the draw for the giveaway happened, with AdequateLlama, Murph and most importantly YummyUranium winning.<br><br>On 15th of June, Squid-G left the staff team. As the staff had lately been dropping like flies, Dave Forehead opened staff applications the day after.<br><br> On the 19th of June, a competitive ruling was announced after it had been discovered that Colin, Yem and HammerSt, who made up the team of DogWithALog, had been intending to cheat in the upcoming WRS Major. They intended to have another player, called Wazzito, who had previously been banned from RLI, play on HammerSt’s account. As well as this, they approached a high-level external bubble player to play on Colin’s account.<br><br> The staff application form deadline was moved twice, first to the 26th of June, and the to the 22nd, as the Major was coming up and Moderators were desperately needed to handle the event well. On June 22nd, the 5 new Moderators were announced: YummyUranium, Bonkersbott, Dlynch, Panicjungle and Jacko.<br><br> The <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series\">WRS Major</a> took place on the 27th of June, and it ran smoothly enough overall. Me and the Boys (Shallow, Robkiernxn and Spectre) took the win over Hoovers (Trace, Smokez and Staar) taking home the big prize of €570. Carbon Zero and Bababooey came 3rd and 4th respectively. The giveaway at the end also happened, and KarlByrn3, Shinny_Shin_ and RoryMurnane_ won.<br><br>6mans was upgraded on the 1st of July to have three tiers for like the second time. The new tier was put above \"Premier\" (despite premier meaning first already) and was named \"Elite\", with many in Lobby 2 crooning over how nice the role the winner would get sounded. <br><br> Dave Forehead left the staff team after 4 years as admin on the 28th of June, having never hit GC. He will forever be known as the G.O.A.T. of RL Ireland. LovelyCans took his place, and Barzey was promoted back to Operator. <br><br> Slibhín Series 1 concluded on the 31st of July. The month long draft league sponsored by Slibihin Gaming incorporated players from various ranks and had an €810 prize pool. The results were as follows: <br><br> 1st: Lighthouse of Alexandria - Tomster, Reece, Gillzo<br> 2nd: Gardens of Babylon - Shane, Solo, JengaBenga<br> 3rd: Statue of Zeus - Shallow, DLynch, Bonkersbott<br> 4th: Colossus of Rhodes - Arctic, Decomp, EmKay<br> 5th-6th: Pyramids of Giza - Panda, LovelyCans, Anthony<br> 5th-6th: Mausoleum of Halicarnassus - LTXSam, JXffa, Deus<br> 7th: Temple of Artemis - Littledude37, Ghost, CaptainQwark <br><br> IEL Season 9 came to a close on the 8th of August with the Master, and Prospect teams making playoffs. The Prospect team had the best run, getting to the Grand Finals. <br><br> Dave Forehead’s farewell staff party took place in Cork on the 21st of August. The first gathering of multiple RLI members since Ballymena LAN in February 2020, a great time was had karting and celebrating the man, the myth, the legend that is Conor Kostick. <br><br> RL Ireland’s 10th LAN, aptly named “LAN #10”, was announced on the 23rd of September. The first post pandemic LAN in Ireland saw a return to the 365 IT Hub in Cork City. <br><br> RLIS Season 6 concluded with an epic finals weekend on the 26th of September, as champions across 5 tiers were crowned. The winners were: <br><br> Superstar<br> High Kings - Tomster, Knutham, My_Parable<br> MVP - Tomster <br><br> All Star<br> The Saints - Decomp, Kronik, Ryan<br> MVP - Decomp <br><br> Shooting Star<br> Celtic Tigers  - Path, Jimingo, SPF<br> MVP - Jimingo <br><br> Ascending Star<br> High Kings - Finbarr, PokeWithAStick, Khrolik<br> MVP - PokeWithAStick <br><br> Rising Star<br> The Banshees - Arnouh, Bas00, SeanPage<br> MVP - Arnough <br><br> Manager of the season - LovelyCans <br><br> A record prize pool of €240 was shared among the winners of Superstar and All Star. <br><br> The Solo Standard 2v2 tournament took place on the 10th of October, with Shallow and Joe reigning supreme over LovelyCans and Viaable in the finals. <br><br> RL Ireland LAN #10 took place in the 365itHub in Cork on the 30th of October. It was a 3v3 LAN with 11 teams entering. Enwrong ran the event on the day. PanicJungle took pictures of all the players, whilst the Casters Cursed trio of EJam, MorkyMork , Nualaoch, and Jacko casted the event. <br><br> image <br><br> In a monumental upset, 4th seed Stroopwafels (DLynch, Thieu, Jimingo) won the grand finals in 7 games over 3rd seed SouthEast Crew (LovelyCans, Decomp, Solo), who themselves upset the eventual 3rd place team Team Shakes (Shallow, Panda, Tomster). Thieu was named MVP of the tournament and YummyUranium, Rory and CK won the Shed Shocker award for placing 5th-6th despite being the 10th seed out of 11 teams. Jacko got promoted to Operator on the day as well. Many new faces showed up to the first post pandemic LAN, and made it one of the most memorable days in RL Ireland’s history. <br><br> GraHa left the staff team on the 1st of November. <br><br> RL Ireland officially got its own liquipedia page on the 2nd of November. It acts as a hub for history of all tournaments RLI, with links to all the social media pages, and is constantly getting more old events added to it. <br><br> The 2021 Winter 3v3 Cups took place on the 21st of November. Ryan, LKolibri and Joe won the tier 2 draft tournament, whilst Pandaa, trace and Decomp won the tier 1 open cup. <br><br> The first Spiral Series Cup took place on the 10th of December, and the winners were: <br><br> Tier 1: Norseford - Tomster, Knutha, Panda<br> Tier 2: Fusion Girls - Ryan, Domhnaill, Crossy <br><br> The RL Ireland Community Awards were announced on the 20th of December, as a way of looking back and celebrating the year that was 2021 in RL Ireland. Community generated nominations and voting took place across 11 categories over the preceding 2 weeks.",
        "ga": "Rinne Dave Forehead a fhógra traidisiúnta deireadh bliana an 1 Eanáir trí fhógairt go raibh RLI ag oscailt iarratais foirne.<br><br>Tháinig JengaBenga, Pokewithastick, Royzer, Coombs agus Wrench go léir leis an bhfoireann foirne ar an 15ú de Eanáir. <br><br>Rinneadh an cuntas <a href=\"https://www.tiktok.com/@rl_ireland\"> RL Ireland TikTok </a> an 18 Eanáir, agus na 5 ghearrthóg is fearr de cuireadh an tseachtain sa phost ansin ar bhonn rialta (leath).<br><br>Fógraíodh an <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series\"> Sraith Roicéid Wylde </a> (WRS) an 2 Feabhra. Sraith de chamchuairteanna míosúla ab ea WRS inar thuill foirne pointí bunaithe ar a gcuid bailchríocha agus cháiligh na foirne leis na pointí is airde don mhórócáid ​​i mí an Mheithimh. Rinne an eagraíocht esports Wylde, atá lonnaithe in Éirinn, urraíocht ar an tsraith iomlán imeachtaí. Ar nóta neamhghaolmhar (ach an lá céanna) fuair bot RLI 6mans a chaptaein a nuashonrú. D’fhéadfadh na himreoirí a roghnú anois an raibh siad ag iarraidh go ndéanfadh an bot nó na captaein na foirne a chinneadh go randamach.<br><br>Tharla an ócáid ​​<a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/February\">an chéad imeacht míosúil WRS</a> ar an 13ú Feabhra. Ghnóthaigh\"team\" (Shallow, Specter agus Aenia) an bua ar Carbon Zero (Shane, Lynsk, Futura).<br><br> Bhuaigh RLI Madra, ceann de chúig fhoireann Templar League RLI Rannán na Ridirí an 20 Feabhra. Chuir GraHa agus Bonkersbott faoi deara sna playoffs, bhí ról ríthábhachtach ag Anthony i rith an tséasúir, agus bhí Dave Forehead ann chun na slisní uisce agus oráiste a sholáthar.<br><br>2/4 a bhí ann do RLI i Templar League mar RLI Sheachaid Sneachta, LTXSam agus Dlynch na hearraí chun roinn Kings a bhuachan, le Fassbendered ag imirt a chuid i rith an tséasúir freisin.<br><br>Bhí Corn an Earraigh 2v2 ar siúl ar an 27 Feabhra, cupán neamhghnách do RLI mar ní raibh sé oscailte ach d’imreoirí C3 nó níos ísle. Bhuaigh UwU Stepdad (Wrench agus Aaron) an ócáid ​​i gcoinne Oaties (CaptainQwark agus Dimitrov) sa chluiche ceannais.<br><br>Tharla <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/March\"> WRS Monthly #2</a>                ar an 14ú Márta le DogWithALog (Yem, Colin, HammerSt - mar a chasfadh sé amach, bhí Wazzito ag imirt go rúnda ar chuntas HammerSt) agus é á thógáil sa chluiche ceannais i gcoinne Me and the Boys (Robkiernxn, Shallow agus Halden).<br><br>                Tharla an chéad imeacht Dúshlán na Foirne riamh ar an 20ú Márta. Bhí 3 shraith d’fhoirne foirne ann le dúshlán a thabhairt do bhaill an phobail. Thuill na foirne foirne taifead 100% -win thar an bpobal.<br><br>Bhuail server neamhord RLI 1000 ball ar an 1 Aibreán. Níl, ní magadh é seo.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/Irish_12_Titans/Season_6\"> Tharla 12 Titans S6 </a> ar an 4 Aibreán. le hiontas iontas ar go leor daoine an lámh in uachtar a fháil ar Colin sa chluiche ceannais. Dúirt Ineffable ar an lá, “Cad a bhí agat don bhricfeasta?” Agus d’fhreagair Shallow “ubh Cásca”.<br><br>Tháinig Séasúr 8 IEL chun deiridh ar an 18 Aibreán leis na foirne Máistir, Challenger agus Prospect go léir ag déanamh playoffs. Bhí an rith is fearr ag foireann Prospect, ag dul go dtí na cluichí leathcheannais. D’fhág Coombs an fhoireann foirne ar an lá seo freisin. <br><br> <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/April\"> Bhí WRS Monthly # 3 </a> ar siúl ar an 25 Aibreán le Mise agus na Buachaillí (Robkiernxn, Specter and Shallow) ag fáil díoltas ar DogWithALog (Yem, Colin agus HammerSt/Wazzito). <br><br>D’fhág JaRyan an fhoireann foirne an 1 Bealtaine, agus Ryan ina dhiaidh sin ar an 6ú, agus ansin Wrench ar an 18ú.<br><br> Bhí <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/May\">WRS Monthly #4</a>                ar siúl ar an 23 Bealtaine le buaiteoir nua Carbon Zero (Shane, Futura agus NKS) ag bualadh Hoovers (Smokez, Trace (Cian roimhe seo) agus Staar) sa chluiche ceannais.<br><br>Bhí an cupán Séasúrach Séasúrach ar siúl ar an 30 Bealtaine le LTXSam, Finbarr agus barmanitan ag buachan sa chluiche ceannais i gcoinne Mul, Gillzo agus P1ayer 0n3.<br><br>Nuashonraíodh an bunleabhar <a href=\"https://docs.google.com/document/d/1oW8iqr8yDmqB2GQdnPGQaZ48TGfP0UFd122TOVHryPg/edit?usp=sharing\"> leabhar staire </a>                ar an 3ú Meitheamh, de réir mar a d’fhás Dave Forehead leisciúil , ag fágáil Lynsk chun an leac a thógáil.<br><br>Chuaigh Wylde agus RLI i gcomhpháirtíocht le haghaidh bronnadh ar an 11 Meitheamh. Gheobhadh na buaiteoirí cailín álainn Wylde nuair a tharla an tarraingt tar éis WRS Monthly # 5.<br><br><a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series/June\">WRS Monthly #5</a> ar siúl ar an 13 Meitheamh, agus ghlac Me and the Boys (Shallow, Robkiernxn agus Specter) an bua thar DogWithALog (Colin, Yem agus HammersSt/Wazzito). Ina dhiaidh sin, tharla an tarraingt don bhronntanas, agus bhuaigh Ade leorLlama, Murph agus YummyUranium is tábhachtaí.<br><br>Ar an 15ú Meitheamh, d’fhág Squid-G an fhoireann foirne. Mar a bhí ag an bhfoireann le déanaí b Ag titim cosúil le cuileoga, d’oscail Dave Forehead iarratais foirne an lá dar gcionn.<br><br>Ar an 19ú Meitheamh, fógraíodh rialú iomaíoch tar éis a fháil amach go raibh rún ag Colin, Yem agus HammerSt, a bhí mar fhoireann DogWithALog, mealladh sa WRS Major atá le teacht. Bhí sé i gceist acu imreoir eile, darb ainm Wazzito, a cuireadh toirmeasc ar RLI roimhe seo, a imirt ar chuntas HammerSt. Chomh maith leis seo, chuaigh siad chuig imreoir mboilgeog seachtrach ardleibhéil chun imirt ar chuntas Colin. Bhí taispeántas fíorfhíor i #general sna huaireanta ina dhiaidh sin, le cúpla duine eile ag fáil toirmisc agus balbh. Cuireadh #general faoi ghlas don oíche, agus bhí # memes-nsfw i bhfolach.<br><br>Bogadh spriocdháta na foirme iarratais foirne faoi dhó, ar dtús go dtí an 26 Meitheamh, agus go dtí an 22ú, toisc go raibh an Major ag teacht suas agus bhí géarghá le Modhnóirí chun an ócáid ​​a láimhseáil go maith. Ar 22 Meitheamh, fógraíodh na 5 Mhodhnóirí nua: YummyUranium, Bonkersbott, Dlynch, Panicjungle agus Jacko.<br><br>Tharla an <a href=\"https://liquipedia.net/rocketleague/RL_Ireland/WYLDE_Rocket_Series\"> WRS Major </a>                an 27 Meitheamh, agus rith sé réidh go leor ar an iomlán. Ghnóthaigh Mise agus na Buachaillí (Shallow, Robkiernxn agus Specter) an bua thar Hoovers (Trace, Smokez agus Staar) agus thug siad an duais mhór de € 570 abhaile. Tháinig Carbon Zero agus Bababooey sa 3ú agus 4ú faoi seach. Tharla an bronnadh ag an deireadh freisin, agus bhuaigh KarlByrn3, Shinny_Shin_ agus RoryMurnane_.<br><br>Uasghrádaíodh 6mans an 1 Iúil chun go mbeadh trí shraith ann mar an dara huair. Anois go raibh i bhfad níos mó de bhanda imreoir ag an server, bhí Enwrong ag éirí bréan de bheith ag imirt le daoine mar EmKay, agus shocraigh sé gur leor a dhóthain, b’éigean an comhrá don tríú sraith a thosú. Cuireadh an tsraith nua os cionn\"Premier\" (in ainneoin gurb é an príomhchiall a bhí ann cheana) agus ainmníodh\"Elite\", agus tá go leor i Stocaireacht 2 ag crónadh faoi cé chomh deas agus a bheadh ​​an ról a gheobhadh an buaiteoir."
    },
    "timeline-2022": {
        "en": "<br><br> On the 2nd of January, the RL Ireland 2021 Community Awards took place, the first time we held Community Awards. The winners were: <br><br> Breakout Player of the Year - Tomster<br> Match of the Year - LAN #10 Grand Finals: S.E.C vs Stroopwafels<br> Team Name of the Year - Open The Pubs<br> Non-Irish Player of the Year -  Thieu<br> Lovely Goal of the Year - Solo pinch vs Team Shakes<br> Caster of the Year - EJam<br> Handsome Bastard of the Year - Redport<br> Shed Shocker of the Year - Spice Bag Academy top 6 at Cork LAN<br> Best New Emote - :LovelyL:<br> Best Moment of 2021 - Lobby 2 Monsters INC Watch Party<br> Player of the Year - Shallow <br><br> Retroactive Player of the Year awards were also given for 2018, 2019 and 2020, and they were: <br><br> 2018 Player of the Year - Mugg<br> 2019 Player of the Year - Adzer<br> 2020 Player of the Year - Panda<br> <br><br> On the 16th of January, the second Spiral Series concluded. The winners were: <br><br> Tier 1 - Wall Munchers the Hard Carry (Solo, Tomster, Goldie)<br> Tier 2 & 3 - Pepper’s Spray (My_Parable, Llama, Finbarr) <br><br> On the 5th of February, the third Spiral Series took place, with Tomster, Jxffa & Jack. winning the event. <br><br> On the 6th of February, RLI’s prospect IEL team of GitsyKing, Finbarr, Gillzo & Anthony was victorious in IEL Season X. The Challenger team did very well in making the playoffs semi-finals, whilst the Academy and Master teams made it to the play-in stage of the playoffs. RLI tied their all time franchise record of 48-16 in JengaBenga’s first season as manager following Dave Forehead’s departure. <br><br> With Psyonix approval, RLI’s 11th LAN was given the greenlight on the 10th of February. Slated for March 12th at the Belong Arena in Newry, it would be the first LAN of 2022. <br><br> PokeWithAStick stepped down from the mod team after 13 months on the 12th of February. <br><br> The Valentines Cup takes place on the 13th of February. Hosted and funded by John_aka_Alwayz, the 2v2 tournament was a celebration of love across all of RLI. The winners were: <br><br> Tier 1 - Knutha & Co. (Knutha + Tomster)<br> Tier 2 - Captain Crillus Face (SPF + Crille)  <br><br> RL Ireland NewryLAN took place in the Belong Arena in Newry on the 12th of March. It was a 3v3 LAN with 14 teams entering, making it the most attended LAN since DGF in 2018. LovelyCans ran the event on the day. PanicJungle took pictures of all the players, whilst casters included MorkyMork, Res, Jacko, NuaLaoch, EJam & Barmanitan. <br><br> image <br><br> After an early loss in the group stage, Slibhín Gaming, consisting of Shallow, Panda and Ineffable battled through a gauntlet to win. They took the grand finals 4-1 over the South East Crew (LovelyCans, Tomster, Solo), with Jammies (Shane, Lynsk, Goldie) coming third. Shallow was named MVP of the tournament and Enwrong, DLynch & Res won the Shed Shocker award for their win over Slibhin Gaming in the group stage. All in all, the 735 euro event was an excellent day for the RLI community. <br><br> Royzer steps down from the mod team after 14 months on the 21st of March. <br><br>"
    },
    "quotes-title": {
        "en": "RLI's Best Quotes",
        "ga": "Ráitis is Fearr de RLI"
    },
    "tournaments-title": {
        "en": "RLI Tournaments",
        "ga": "Comórtais RLI"
    },
    "personalities-title": {
        "en": "RLI's Personalities",
        "ga": "Pearsantachtaí RLI"
    }
}